---
kind: method
id: M:Autodesk.Revit.DB.Structure.ExtElemChangeBeamSectionRegistry.Unregister
source: html/40dabf36-f37e-bf22-86fb-471da335766d.htm
---
# Autodesk.Revit.DB.Structure.ExtElemChangeBeamSectionRegistry.Unregister Method

Unregisters IExtElemChangeBeamSection.

## Syntax (C#)
```csharp
public static void Unregister()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - There is no valid Connections Provider registered.